STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE_Thread/BLE_HeartRate_Thread_FreeRTOS/STM32_WPAN/App/app_ble.c
uint64_t buffer_nvm[CFG_BLEPLAT_NVM_MAX_SIZE] = {0};

static AMM_VirtualMemoryCallbackFunction_t APP_BLE_ResumeFlowProcessCb;

/* Host stack init variables */
static uint32_t buffer[DIVC(BLE_DYN_ALLOC_SIZE, 4)];
static uint32_t gatt_buffer[DIVC(BLE_GATT_BUF_SIZE, 4)];
static BleStack_init_t pInitParams;

/* BLE_STACK_TASK related resources */
osSemaphoreId_t         BleStackSemaphore;
osThreadId_t            BleStackThread;

osThreadId_t            HCIasyncEvtThread;

osSemaphoreId_t         ProcGapCompleteSemaphore;
/* HCI_ASYNC_EVT_TASK related resources */
osSemaphoreId_t         HCIasyncEvtSemaphore;

const osThreadAttr_t stBleStackTaskAttributes = 
{
  .name = "BLE Stack Task",
  .priority = CFG_TASK_PRIO_BLE_STACK,
  .stack_size = TASK_BLE_STACK_STACK_SIZE,
};

const osThreadAttr_t stHCIasyncEvtTaskAttributes = {
    .name = "HCI asynch event Task",
    .priority = CFG_TASK_PRIO_HCI_ASYNCH_EVT,
    .stack_size = TASK_HCI_ASYNCH_EVT_STACK_SIZE
};


/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static void BleStack_Process_BG(void);
static void Ble_UserEvtRx(void);
static void BLE_ResumeFlowProcessCallback(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress(void);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);
static void BLE_NvmCallback (SNVMA_Callback_Status_t);
static uint8_t HOST_BLE_Init(void);
static void BleUserEvtRx_Task_Entry(void* thread_input);
static void BleStack_Task_Entry(void* thread_input);
/* USER CODE BEGIN PFP */
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t*p_bd_addr);
#if (BLE_RADIO_ACTIVITY_ON_LED_SUPPORT != 0)
static void Switch_OFF_Led(void *arg);
#endif
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */
#if (BLE_RADIO_ACTIVITY_ON_LED_SUPPORT != 0)
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
#endif
  /* USER CODE END APP_BLE_Init_1 */

  LST_init_head(&BleAsynchEventQueue);

  const osSemaphoreAttr_t BleStackSemaphore_attributes = {
    .name = "BLE stack Semaphore"
  };
  BleStackSemaphore = osSemaphoreNew(1U, 0U, &BleStackSemaphore_attributes);
  if (BleStackSemaphore == NULL)
  {
    Error_Handler();
  }

  BleStackThread = osThreadNew(BleStack_Task_Entry, NULL, &stBleStackTaskAttributes);
  if (BleStackThread == NULL)
  {
    Error_Handler();
  }

  const osSemaphoreAttr_t HCIasyncEvtSemaphore_attributes = {
    .name = "HCI asynch EVT Semaphore"
  };
  HCIasyncEvtSemaphore = osSemaphoreNew(1U, 0U, &HCIasyncEvtSemaphore_attributes);
  if (HCIasyncEvtSemaphore == NULL)
  {
    Error_Handler();
  }

  HCIasyncEvtThread = osThreadNew(BleUserEvtRx_Task_Entry, NULL, &stHCIasyncEvtTaskAttributes);
  if (HCIasyncEvtThread == NULL)
  {
    Error_Handler();
  }

  /* NVM emulation in RAM initialization */
  NVM_Init(buffer_nvm, 0, CFG_BLEPLAT_NVM_MAX_SIZE);

  /* First register the APP BLE buffer */
  SNVMA_Register (APP_BLE_NvmBuffer,
                  (uint32_t *)buffer_nvm,
                  (CFG_BLEPLAT_NVM_MAX_SIZE * 2));

  /* Realize a restore */
  SNVMA_Restore (APP_BLE_NvmBuffer);
  /* USER CODE BEGIN APP_BLE_Init_Buffers */

  /* USER CODE END APP_BLE_Init_Buffers */

  /* Check consistency */
  if (NVM_Get (NVM_FIRST, 0xFF, 0, 0, 0) != NVM_EOF)
  {
    NVM_Discard (NVM_ALL);
  }

  /* Initialize the BLE Host */
  if (HOST_BLE_Init() == 0u)
  {
    /* Initialization of HCI & GATT & GAP layer */
    Ble_Hci_Gap_Gatt_Init();

    const osSemaphoreAttr_t ProcGapCompleteSemaphore_attributes = {
      .name = "ProcGapCompleteSemaphore"
    };
    ProcGapCompleteSemaphore = osSemaphoreNew(1U, 0U, &ProcGapCompleteSemaphore_attributes);
    if (ProcGapCompleteSemaphore == NULL)
    {
      Error_Handler();
    }

    /* Initialization of the BLE Services */
    SVCCTL_Init();

    /* Initialization of the BLE App Context */
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    bleAppContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

    /* From here, all initialization are BLE application specific */

    /* USER CODE BEGIN APP_BLE_Init_4 */

    /* USER CODE END APP_BLE_Init_4 */

    /* Initialize Services and Characteristics. */
    LOG_INFO_APP("\n");
    LOG_INFO_APP("Services and Characteristics creation\n");
    HRS_APP_Init();
    DIS_APP_Init();
    LOG_INFO_APP("End of Services and Characteristics creation\n");
    LOG_INFO_APP("\n");

    /* USER CODE BEGIN APP_BLE_Init_3 */
#if (BLE_RADIO_ACTIVITY_ON_LED_SUPPORT != 0)
    ret = aci_hal_set_radio_activity_mask(0x0006);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%2X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
    }
    
    /* Create timer to handle the Led Switch OFF */
    UTIL_TIMER_Create(&(bleAppContext.SwitchOffLed_timer_Id),
                      0,
                      UTIL_TIMER_ONESHOT,
                      &Switch_OFF_Led,
                      0);
#endif
    
    /* Start to Advertise to accept a connection */
    uint16_t adv_cmd = 0;
    osMessageQueuePut(advertisingCmdQueueHandle, &adv_cmd, 0U, 0U);
    
    /* USER CODE END APP_BLE_Init_3 */

  }
  /* USER CODE BEGIN APP_BLE_Init_2 */
  bleAppContext.connIntervalFlag = 0;
  /* USER CODE END APP_BLE_Init_2 */

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  tBleStatus ret = BLE_STATUS_ERROR;
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;

